DataProcessors/упРМАдминистратораГеоданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМАдминистратораГеоданных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/упИерархияГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИерархияГеографическихЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/упГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГеографическиеЗоны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Nominatim_place_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>osm_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляУчетаМестоположений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроходитЧерез180Меридиан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиПолигонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полигон</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолигонПростой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/упРМАдминистратораГеоданных/Ext/ManagerModule.bsl
Процедура ПолучитьСписокЗонИРодителей(ПараметрыВызоваСервера, АдресХранилища) Экспорт
	
	ШаблонСДанными = ПолучитьСписокЗонИРодителейЗапрос();
	АдресХранилища = ПоместитьВоВременноеХранилище(ШаблонСДанными, АдресХранилища);
	
КонецПроцедуры



Функция ПолучитьСписокЗонИРодителейЗапрос() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упГеографическиеЗоныПолигон.НомерСтроки) КАК КоличествоСтрок,
	               |	упГеографическиеЗоныПолигон.Ссылка.Ссылка
	               |ПОМЕСТИТЬ втВсеГеозоны
	               |ИЗ
	               |	Справочник.упГеографическиеЗоны.Полигон КАК упГеографическиеЗоныПолигон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упГеографическиеЗоныПолигон.Ссылка.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втВсеГеозоны.Ссылка КАК Зона
	               |ПОМЕСТИТЬ втГеокодированны
	               |ИЗ
	               |	втВсеГеозоны КАК втВсеГеозоны
	               |ГДЕ
	               |	втВсеГеозоны.КоличествоСтрок > 2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упИерархияГеографическихЗон.Зона КАК Зона,
	               |	упИерархияГеографическихЗон.Родитель,
	               |	упИерархияГеографическихЗон.Уровень КАК Уровень
	               |ПОМЕСТИТЬ втЗоныРодителиУровни
	               |ИЗ
	               |	РегистрСведений.упИерархияГеографическихЗон КАК упИерархияГеографическихЗон,
	               |	втГеокодированны КАК втГеокодированны
	               |ГДЕ
	               |	упИерархияГеографическихЗон.Зона <> упИерархияГеографическихЗон.Родитель
	               |	И упИерархияГеографическихЗон.Зона В
	               |			(ВЫБРАТЬ
	               |				втГеокодированны.Зона
	               |			ИЗ
	               |				втГеокодированны КАК втГеокодированны)
	               |	И упИерархияГеографическихЗон.Родитель В
	               |			(ВЫБРАТЬ
	               |				втГеокодированны.Зона
	               |			ИЗ
	               |				втГеокодированны КАК втГеокодированны)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(втЗоныРодителиУровни.Уровень) КАК Уровень,
	               |	втЗоныРодителиУровни.Зона
	               |ПОМЕСТИТЬ втМаксимальныеУровни
	               |ИЗ
	               |	втЗоныРодителиУровни КАК втЗоныРодителиУровни
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втЗоныРодителиУровни.Зона
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втЗоныРодителиУровни.Зона,
	               |	втЗоныРодителиУровни.Родитель
	               |ПОМЕСТИТЬ втЗоныИРодители
	               |ИЗ
	               |	втЗоныРодителиУровни КАК втЗоныРодителиУровни
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаксимальныеУровни КАК втМаксимальныеУровни
	               |		ПО втЗоныРодителиУровни.Уровень = втМаксимальныеУровни.Уровень
	               |			И втЗоныРодителиУровни.Зона = втМаксимальныеУровни.Зона
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упГеографическиеЗоныПолигон.Широта,
	               |	упГеографическиеЗоныПолигон.Долгота,
	               |	втЗоныИРодители.Зона,
	               |	втЗоныИРодители.Родитель
	               |ПОМЕСТИТЬ втТочки
	               |ИЗ
	               |	Справочник.упГеографическиеЗоны.Полигон КАК упГеографическиеЗоныПолигон
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗоныИРодители КАК втЗоныИРодители
	               |		ПО упГеографическиеЗоныПолигон.Ссылка.Ссылка = втЗоныИРодители.Зона
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упГеографическиеЗоныПолигон.Ссылка КАК Зона,
	               |	КОЛИЧЕСТВО(упГеографическиеЗоныПолигон.НомерСтроки) КАК Количество,
	               |	МИНИМУМ(упГеографическиеЗоныПолигон.Широта) КАК Широта_Мин,
	               |	МАКСИМУМ(упГеографическиеЗоныПолигон.Широта) КАК Широта_Макс,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА упГеографическиеЗоныПолигон.Ссылка.ПроходитЧерез180Меридиан
	               |				ТОГДА ВЫБОР
	               |						КОГДА упГеографическиеЗоныПолигон.Долгота < 0
	               |							ТОГДА 360 + упГеографическиеЗоныПолигон.Долгота
	               |						ИНАЧЕ упГеографическиеЗоныПолигон.Долгота
	               |					КОНЕЦ
	               |			ИНАЧЕ упГеографическиеЗоныПолигон.Долгота
	               |		КОНЕЦ) КАК Долгота_Мин,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА упГеографическиеЗоныПолигон.Ссылка.ПроходитЧерез180Меридиан
	               |				ТОГДА ВЫБОР
	               |						КОГДА упГеографическиеЗоныПолигон.Долгота < 0
	               |							ТОГДА 360 + упГеографическиеЗоныПолигон.Долгота
	               |						ИНАЧЕ упГеографическиеЗоныПолигон.Долгота
	               |					КОНЕЦ
	               |			ИНАЧЕ упГеографическиеЗоныПолигон.Долгота
	               |		КОНЕЦ) КАК Долгота_Макс,
	               |	упГеографическиеЗоныПолигон.Ссылка.ПроходитЧерез180Меридиан КАК Меридиан_180
	               |ПОМЕСТИТЬ втПолигонПараметры
	               |ИЗ
	               |	Справочник.упГеографическиеЗоны.Полигон КАК упГеографическиеЗоныПолигон,
	               |	втЗоныИРодители КАК втЗоныИРодители
	               |ГДЕ
	               |	упГеографическиеЗоныПолигон.Ссылка.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втЗоныИРодители.Родитель
	               |			ИЗ
	               |				втЗоныИРодители КАК втЗоныИРодители)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упГеографическиеЗоныПолигон.Ссылка,
	               |	упГеографическиеЗоныПолигон.Ссылка.ПроходитЧерез180Меридиан
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Точки.Зона КАК ЗонаТочки,
	               |	Точки.Родитель КАК Родитель,
	               |	Точки.Широта,
	               |	Точки.Долгота
	               |ПОМЕСТИТЬ ТочкиНаходятсяВЗонеРодителя
	               |ИЗ
	               |	втПолигонПараметры КАК втПолигонПараметры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТочки КАК Точки
	               |		ПО (ВЫБОР
	               |				КОГДА втПолигонПараметры.Меридиан_180
	               |					ТОГДА ВЫБОР
	               |							КОГДА Точки.Долгота < 0
	               |								ТОГДА 360 + Точки.Долгота
	               |							ИНАЧЕ Точки.Долгота
	               |						КОНЕЦ
	               |				ИНАЧЕ Точки.Долгота
	               |			КОНЕЦ МЕЖДУ втПолигонПараметры.Долгота_Мин И втПолигонПараметры.Долгота_Макс)
	               |			И (Точки.Широта МЕЖДУ втПолигонПараметры.Широта_Мин И втПолигонПараметры.Широта_Макс)
	               |			И втПолигонПараметры.Зона = Точки.Родитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТочкиНаходятсяВЗонеРодителя.ЗонаТочки, """") = """"
	               |			ТОГДА втТочки.Зона
	               |	КОНЕЦ КАК Зона
	               |ПОМЕСТИТЬ втНевошедшиеЗоны
	               |ИЗ
	               |	втТочки КАК втТочки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНаходятсяВЗонеРодителя КАК ТочкиНаходятсяВЗонеРодителя
	               |		ПО втТочки.Широта = ТочкиНаходятсяВЗонеРодителя.Широта
	               |			И втТочки.Долгота = ТочкиНаходятсяВЗонеРодителя.Долгота
	               |			И втТочки.Родитель = ТочкиНаходятсяВЗонеРодителя.Родитель
	               |			И втТочки.Зона = ТочкиНаходятсяВЗонеРодителя.ЗонаТочки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втЗоныИРодители.Зона,
	               |	втЗоныИРодители.Родитель
	               |ИЗ
	               |	втНевошедшиеЗоны КАК втНевошедшиеЗоны
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗоныИРодители КАК втЗоныИРодители
	               |		ПО втНевошедшиеЗоны.Зона = втЗоныИРодители.Зона";
				   
				   Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
